// Задача 18: Напишите программу, 
// которая по заданному номеру четверти, 
// показывает диапазон возможных координат точек в этой четверти (x и y).

Console.WriteLine("Введите номер четверти");
int number = Convert.ToInt32(Console.ReadLine());
if (number == 1)
    {
        Console.WriteLine("Координтаы х в данной четверти > 0, координаты у > 0");
    }
    else 
    {
        if (number == 2)
            {
            Console.WriteLine("Координтаы х в данной четверти < 0, координаты у > 0");
            }
        else 
        { if (number == 3)
            {
            Console.WriteLine("Координтаы х в данной четверти < 0, координаты у < 0");
            }
            else 
            { if (number == 4)
            {
            Console.WriteLine("Координтаы х в данной четверти > 0, координаты у < 0");
            }
            else 
            {
            Console.WriteLine("Неверный номер четверти. Это должно быть число от 1 до 4");
            }
            }
        }

    }
